zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133fxx_ca7.h
/****************  Bit definition for DDRCTRL_SCHED register  *****************/
#define DDRCTRL_SCHED_FORCE_LOW_PRI_N_Pos        (0U)
#define DDRCTRL_SCHED_FORCE_LOW_PRI_N_Msk        (0x1UL << DDRCTRL_SCHED_FORCE_LOW_PRI_N_Pos)         /*!< 0x00000001 */
#define DDRCTRL_SCHED_FORCE_LOW_PRI_N            DDRCTRL_SCHED_FORCE_LOW_PRI_N_Msk                   /*!< Active low signal. When asserted (\q0\q), all incoming transactions are forced to low priority. This implies that all high priority read (HPR) and variable priority read commands (VPR) are treated as low priority read (LPR) commands. On the write side, all variable priority write (VPW) commands are treated as normal priority write (NPW) commands. Forcing the incoming transactions to low priority implicitly turns off bypass path for read commands. */
#define DDRCTRL_SCHED_PREFER_WRITE_Pos           (1U)
#define DDRCTRL_SCHED_PREFER_WRITE_Msk           (0x1UL << DDRCTRL_SCHED_PREFER_WRITE_Pos)            /*!< 0x00000002 */
#define DDRCTRL_SCHED_PREFER_WRITE               DDRCTRL_SCHED_PREFER_WRITE_Msk                      /*!< If set then the bank selector prefers writes over reads. */
#define DDRCTRL_SCHED_PAGECLOSE_Pos              (2U)
#define DDRCTRL_SCHED_PAGECLOSE_Msk              (0x1UL << DDRCTRL_SCHED_PAGECLOSE_Pos)               /*!< 0x00000004 */
#define DDRCTRL_SCHED_PAGECLOSE                  DDRCTRL_SCHED_PAGECLOSE_Msk                         /*!< If true, bank is kept open only while there are page hit transactions available in the CAM to that bank. The last read or write command in the CAM with a bank and page hit is executed with auto-precharge if SCHED1.pageclose_timer=0. Even if this register set to 1 and SCHED1.pageclose_timer is set to 0, explicit precharge (and not auto-precharge) may be issued in some cases where there is a mode switch between write and read or between LPR and HPR. The Read and Write commands that are executed as part of the ECC scrub requests are also executed without auto-precharge. */
#define DDRCTRL_SCHED_LPR_NUM_ENTRIES_Pos        (8U)
#define DDRCTRL_SCHED_LPR_NUM_ENTRIES_Msk        (0xFUL << DDRCTRL_SCHED_LPR_NUM_ENTRIES_Pos)         /*!< 0x00000F00 */
#define DDRCTRL_SCHED_LPR_NUM_ENTRIES            DDRCTRL_SCHED_LPR_NUM_ENTRIES_Msk                   /*!< Number of entries in the low priority transaction store is this value + 1. */
#define DDRCTRL_SCHED_LPR_NUM_ENTRIES_0          (0x1UL << DDRCTRL_SCHED_LPR_NUM_ENTRIES_Pos)         /*!< 0x00000100 */
#define DDRCTRL_SCHED_LPR_NUM_ENTRIES_1          (0x2UL << DDRCTRL_SCHED_LPR_NUM_ENTRIES_Pos)         /*!< 0x00000200 */
#define DDRCTRL_SCHED_LPR_NUM_ENTRIES_2          (0x4UL << DDRCTRL_SCHED_LPR_NUM_ENTRIES_Pos)         /*!< 0x00000400 */
#define DDRCTRL_SCHED_LPR_NUM_ENTRIES_3          (0x8UL << DDRCTRL_SCHED_LPR_NUM_ENTRIES_Pos)         /*!< 0x00000800 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos (16U)
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Msk (0xFFUL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos) /*!< 0x00FF0000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS     DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Msk            /*!< UNUSED */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_0   (0x1UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos)  /*!< 0x00010000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_1   (0x2UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos)  /*!< 0x00020000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_2   (0x4UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos)  /*!< 0x00040000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_3   (0x8UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos)  /*!< 0x00080000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_4   (0x10UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos) /*!< 0x00100000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_5   (0x20UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos) /*!< 0x00200000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_6   (0x40UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos) /*!< 0x00400000 */
#define DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_7   (0x80UL << DDRCTRL_SCHED_GO2CRITICAL_HYSTERESIS_Pos) /*!< 0x00800000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos          (24U)
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_Msk          (0x7FUL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)          /*!< 0x7F000000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP              DDRCTRL_SCHED_RDWR_IDLE_GAP_Msk                     /*!< When the preferred transaction store is empty for these many clock cycles, switch to the alternate transaction store if it is non-empty. */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_0            (0x1UL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)           /*!< 0x01000000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_1            (0x2UL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)           /*!< 0x02000000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_2            (0x4UL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)           /*!< 0x04000000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_3            (0x8UL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)           /*!< 0x08000000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_4            (0x10UL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)          /*!< 0x10000000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_5            (0x20UL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)          /*!< 0x20000000 */
#define DDRCTRL_SCHED_RDWR_IDLE_GAP_6            (0x40UL << DDRCTRL_SCHED_RDWR_IDLE_GAP_Pos)          /*!< 0x40000000 */

/****************  Bit definition for DDRCTRL_SCHED1 register  ****************/
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos (0U)
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_Msk (0xFFUL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos) /*!< 0x000000FF */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER     DDRCTRL_SCHED1_PAGECLOSE_TIMER_Msk            /*!< This field works in conjunction with SCHED.pageclose. */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_0   (0x1UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos)  /*!< 0x00000001 */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_1   (0x2UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos)  /*!< 0x00000002 */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_2   (0x4UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos)  /*!< 0x00000004 */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_3   (0x8UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos)  /*!< 0x00000008 */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_4   (0x10UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos) /*!< 0x00000010 */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_5   (0x20UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos) /*!< 0x00000020 */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_6   (0x40UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos) /*!< 0x00000040 */
#define DDRCTRL_SCHED1_PAGECLOSE_TIMER_7   (0x80UL << DDRCTRL_SCHED1_PAGECLOSE_TIMER_Pos) /*!< 0x00000080 */

/***************  Bit definition for DDRCTRL_PERFHPR1 register  ***************/
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos      (0U)
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Msk      (0xFFFFUL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)    /*!< 0x0000FFFF */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE          DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Msk                 /*!< Number of DFI clocks that the HPR queue can be starved before it goes critical. The minimum valid functional value for this register is 0x1. Programming it to 0x0 disables the starvation functionality; during normal operation, this function must not be disabled as it causes excessive latencies. */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_0        (0x1UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)       /*!< 0x00000001 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_1        (0x2UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)       /*!< 0x00000002 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_2        (0x4UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)       /*!< 0x00000004 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_3        (0x8UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)       /*!< 0x00000008 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_4        (0x10UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)      /*!< 0x00000010 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_5        (0x20UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)      /*!< 0x00000020 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_6        (0x40UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)      /*!< 0x00000040 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_7        (0x80UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)      /*!< 0x00000080 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_8        (0x100UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)     /*!< 0x00000100 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_9        (0x200UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)     /*!< 0x00000200 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_10       (0x400UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)     /*!< 0x00000400 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_11       (0x800UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)     /*!< 0x00000800 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_12       (0x1000UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)    /*!< 0x00001000 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_13       (0x2000UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)    /*!< 0x00002000 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_14       (0x4000UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)    /*!< 0x00004000 */
#define DDRCTRL_PERFHPR1_HPR_MAX_STARVE_15       (0x8000UL << DDRCTRL_PERFHPR1_HPR_MAX_STARVE_Pos)    /*!< 0x00008000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos (24U)
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Msk (0xFFUL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos) /*!< 0xFF000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH      DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Msk           /*!< Number of transactions that are serviced once the HPR queue goes critical is the smaller of: */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_0   (0x1UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos)  /*!< 0x01000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_1   (0x2UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos)  /*!< 0x02000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_2   (0x4UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos)  /*!< 0x04000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_3   (0x8UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos)  /*!< 0x08000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_4   (0x10UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos) /*!< 0x10000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_5   (0x20UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos) /*!< 0x20000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_6   (0x40UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos) /*!< 0x40000000 */
#define DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_7   (0x80UL << DDRCTRL_PERFHPR1_HPR_XACT_RUN_LENGTH_Pos) /*!< 0x80000000 */

/***************  Bit definition for DDRCTRL_PERFLPR1 register  ***************/
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos      (0U)
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Msk      (0xFFFFUL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)    /*!< 0x0000FFFF */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE          DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Msk                 /*!< Number of DFI clocks that the LPR queue can be starved before it goes critical. The minimum valid functional value for this register is 0x1. Programming it to 0x0 disables the starvation functionality; during normal operation, this function must be disabled as it causes excessive latencies. */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_0        (0x1UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)       /*!< 0x00000001 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_1        (0x2UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)       /*!< 0x00000002 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_2        (0x4UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)       /*!< 0x00000004 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_3        (0x8UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)       /*!< 0x00000008 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_4        (0x10UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)      /*!< 0x00000010 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_5        (0x20UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)      /*!< 0x00000020 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_6        (0x40UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)      /*!< 0x00000040 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_7        (0x80UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)      /*!< 0x00000080 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_8        (0x100UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)     /*!< 0x00000100 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_9        (0x200UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)     /*!< 0x00000200 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_10       (0x400UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)     /*!< 0x00000400 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_11       (0x800UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)     /*!< 0x00000800 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_12       (0x1000UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)    /*!< 0x00001000 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_13       (0x2000UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)    /*!< 0x00002000 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_14       (0x4000UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)    /*!< 0x00004000 */
#define DDRCTRL_PERFLPR1_LPR_MAX_STARVE_15       (0x8000UL << DDRCTRL_PERFLPR1_LPR_MAX_STARVE_Pos)    /*!< 0x00008000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos (24U)
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Msk (0xFFUL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos) /*!< 0xFF000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH     DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Msk            /*!< Number of transactions that are serviced once the LPR queue goes critical is the smaller of: */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_0   (0x1UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos)  /*!< 0x01000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_1   (0x2UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos)  /*!< 0x02000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_2   (0x4UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos)  /*!< 0x04000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_3   (0x8UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos)  /*!< 0x08000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_4   (0x10UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos) /*!< 0x10000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_5   (0x20UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos) /*!< 0x20000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_6   (0x40UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos) /*!< 0x40000000 */
#define DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_7   (0x80UL << DDRCTRL_PERFLPR1_LPR_XACT_RUN_LENGTH_Pos) /*!< 0x80000000 */

/***************  Bit definition for DDRCTRL_PERFWR1 register  ****************/
#define DDRCTRL_PERFWR1_W_MAX_STARVE_Pos      (0U)
#define DDRCTRL_PERFWR1_W_MAX_STARVE_Msk      (0xFFFFUL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)    /*!< 0x0000FFFF */
#define DDRCTRL_PERFWR1_W_MAX_STARVE          DDRCTRL_PERFWR1_W_MAX_STARVE_Msk                 /*!< Number of DFI clocks that the WR queue can be starved before it goes critical. The minimum valid functional value for this register is 0x1. Programming it to 0x0 disables the starvation functionality; during normal operation, this function must not be disabled as it causes excessive latencies. */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_0        (0x1UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)       /*!< 0x00000001 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_1        (0x2UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)       /*!< 0x00000002 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_2        (0x4UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)       /*!< 0x00000004 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_3        (0x8UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)       /*!< 0x00000008 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_4        (0x10UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)      /*!< 0x00000010 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_5        (0x20UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)      /*!< 0x00000020 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_6        (0x40UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)      /*!< 0x00000040 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_7        (0x80UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)      /*!< 0x00000080 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_8        (0x100UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)     /*!< 0x00000100 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_9        (0x200UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)     /*!< 0x00000200 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_10       (0x400UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)     /*!< 0x00000400 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_11       (0x800UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)     /*!< 0x00000800 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_12       (0x1000UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)    /*!< 0x00001000 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_13       (0x2000UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)    /*!< 0x00002000 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_14       (0x4000UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)    /*!< 0x00004000 */
#define DDRCTRL_PERFWR1_W_MAX_STARVE_15       (0x8000UL << DDRCTRL_PERFWR1_W_MAX_STARVE_Pos)    /*!< 0x00008000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos (24U)
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Msk (0xFFUL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos) /*!< 0xFF000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH     DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Msk            /*!< Number of transactions that are serviced once the WR queue goes critical is the smaller of: */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_0   (0x1UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos)  /*!< 0x01000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_1   (0x2UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos)  /*!< 0x02000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_2   (0x4UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos)  /*!< 0x04000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_3   (0x8UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos)  /*!< 0x08000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_4   (0x10UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos) /*!< 0x10000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_5   (0x20UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos) /*!< 0x20000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_6   (0x40UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos) /*!< 0x40000000 */
#define DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_7   (0x80UL << DDRCTRL_PERFWR1_W_XACT_RUN_LENGTH_Pos) /*!< 0x80000000 */

/*****************  Bit definition for DDRCTRL_DBG0 register  *****************/
#define DDRCTRL_DBG0_DIS_WC_Pos                 (0U)
#define DDRCTRL_DBG0_DIS_WC_Msk                 (0x1UL << DDRCTRL_DBG0_DIS_WC_Pos)                 /*!< 0x00000001 */
#define DDRCTRL_DBG0_DIS_WC                     DDRCTRL_DBG0_DIS_WC_Msk                           /*!< When 1, disable write combine. */
#define DDRCTRL_DBG0_DIS_COLLISION_PAGE_OPT_Pos (4U)
#define DDRCTRL_DBG0_DIS_COLLISION_PAGE_OPT_Msk (0x1UL << DDRCTRL_DBG0_DIS_COLLISION_PAGE_OPT_Pos) /*!< 0x00000010 */
#define DDRCTRL_DBG0_DIS_COLLISION_PAGE_OPT     DDRCTRL_DBG0_DIS_COLLISION_PAGE_OPT_Msk           /*!< When this is set to \q0\q, auto-precharge is disabled for the flushed command in a collision case. Collision cases are write followed by read to same address, read followed by write to same address, or write followed by write to same address with DBG0.dis_wc bit = 1 (where same address comparisons exclude the two address bits representing critical word). */

/*****************  Bit definition for DDRCTRL_DBG1 register  *****************/
#define DDRCTRL_DBG1_DIS_DQ_Pos  (0U)
#define DDRCTRL_DBG1_DIS_DQ_Msk  (0x1UL << DDRCTRL_DBG1_DIS_DQ_Pos)  /*!< 0x00000001 */
#define DDRCTRL_DBG1_DIS_DQ      DDRCTRL_DBG1_DIS_DQ_Msk            /*!< When 1, DDRCTRL does not de-queue any transactions from the CAM. Bypass is also disabled. All transactions are queued in the CAM. No reads or writes are issued to SDRAM as long as this is asserted. */
#define DDRCTRL_DBG1_DIS_HIF_Pos (1U)
#define DDRCTRL_DBG1_DIS_HIF_Msk (0x1UL << DDRCTRL_DBG1_DIS_HIF_Pos) /*!< 0x00000002 */
#define DDRCTRL_DBG1_DIS_HIF     DDRCTRL_DBG1_DIS_HIF_Msk           /*!< When 1, DDRCTRL asserts the HIF command signal hif_cmd_stall. DDRCTRL ignores the hif_cmd_valid and all other associated request signals. */

