zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133fxx_ca7.h
/**********************  Bit definition for GPIO_VERR register  *****************/
#define GPIO_VERR_MINREV_Pos      (0U)
#define GPIO_VERR_MINREV_Msk      (0xFUL << GPIO_VERR_MINREV_Pos)               /*!< 0x0000000F */
#define GPIO_VERR_MINREV          GPIO_VERR_MINREV_Msk                         /*!< Minor Revision number */
#define GPIO_VERR_MAJREV_Pos      (4U)
#define GPIO_VERR_MAJREV_Msk      (0xFUL << GPIO_VERR_MAJREV_Pos)               /*!< 0x000000F0 */
#define GPIO_VERR_MAJREV          GPIO_VERR_MAJREV_Msk                         /*!< Major Revision number */

/**********************  Bit definition for GPIO_IPIDR register  ****************/
#define GPIO_IPIDR_IPID_Pos       (0U)
#define GPIO_IPIDR_IPID_Msk       (0xFFFFFFFFUL << GPIO_IPIDR_IPID_Pos)         /*!< 0xFFFFFFFF */
#define GPIO_IPIDR_IPID           GPIO_IPIDR_IPID_Msk                          /*!< IP Identification */

/**********************  Bit definition for GPIO_SIDR register  *****************/
#define GPIO_SIDR_SID_Pos         (0U)
#define GPIO_SIDR_SID_Msk         (0xFFFFFFFFUL << GPIO_SIDR_SID_Pos)           /*!< 0xFFFFFFFF */
#define GPIO_SIDR_SID             GPIO_SIDR_SID_Msk                            /*!< IP size identification */

/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  c7amba_hash1@v4_0                     ********************/

/******************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT_Pos          (2U)
#define HASH_CR_INIT_Msk          (0x1UL << HASH_CR_INIT_Pos)                   /*!< 0x00000004 */
#define HASH_CR_INIT              HASH_CR_INIT_Msk
#define HASH_CR_DMAE_Pos          (3U)
#define HASH_CR_DMAE_Msk          (0x1UL << HASH_CR_DMAE_Pos)                   /*!< 0x00000008 */
#define HASH_CR_DMAE              HASH_CR_DMAE_Msk
#define HASH_CR_DATATYPE_Pos      (4U)
#define HASH_CR_DATATYPE_Msk      (0x3UL << HASH_CR_DATATYPE_Pos)               /*!< 0x00000030 */
#define HASH_CR_DATATYPE          HASH_CR_DATATYPE_Msk
#define HASH_CR_DATATYPE_0        (0x1UL << HASH_CR_DATATYPE_Pos)               /*!< 0x00000010 */
#define HASH_CR_DATATYPE_1        (0x2UL << HASH_CR_DATATYPE_Pos)               /*!< 0x00000020 */
#define HASH_CR_MODE_Pos          (6U)
#define HASH_CR_MODE_Msk          (0x1UL << HASH_CR_MODE_Pos)                   /*!< 0x00000040 */
#define HASH_CR_MODE              HASH_CR_MODE_Msk
#define HASH_CR_ALGO_Pos          (17U)
#define HASH_CR_ALGO_Msk          (0xFUL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO              HASH_CR_ALGO_Msk
#define HASH_CR_ALGO_0            (0x1UL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO_1            (0x2UL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO_2            (0x4UL << HASH_CR_ALGO_Pos)
#define HASH_CR_ALGO_3            (0x8UL << HASH_CR_ALGO_Pos)
#define HASH_CR_NBW_Pos           (8U)
#define HASH_CR_NBW_Msk           (0xFUL << HASH_CR_NBW_Pos)                    /*!< 0x00000F00 */
#define HASH_CR_NBW               HASH_CR_NBW_Msk
#define HASH_CR_NBW_0             (0x1UL << HASH_CR_NBW_Pos)                    /*!< 0x00000100 */
#define HASH_CR_NBW_1             (0x2UL << HASH_CR_NBW_Pos)                    /*!< 0x00000200 */
#define HASH_CR_NBW_2             (0x4UL << HASH_CR_NBW_Pos)                    /*!< 0x00000400 */
#define HASH_CR_NBW_3             (0x8UL << HASH_CR_NBW_Pos)                    /*!< 0x00000800 */
#define HASH_CR_DINNE_Pos         (12U)
#define HASH_CR_DINNE_Msk         (0x1UL << HASH_CR_DINNE_Pos)                  /*!< 0x00001000 */
#define HASH_CR_DINNE             HASH_CR_DINNE_Msk
#define HASH_CR_DMAA_Pos          (14U)
#define HASH_CR_DMAA_Msk          (0x1UL << HASH_CR_DMAA_Pos)                   /*!< 0x00004000 */
#define HASH_CR_DMAA              HASH_CR_DMAA_Msk
#define HASH_CR_MDMAT_Pos         (13U)
#define HASH_CR_MDMAT_Msk         (0x1UL << HASH_CR_MDMAT_Pos)                 /*!< 0x00002000 */
#define HASH_CR_MDMAT             HASH_CR_MDMAT_Msk
#define HASH_CR_LKEY_Pos          (16U)
#define HASH_CR_LKEY_Msk          (0x1UL << HASH_CR_LKEY_Pos)                   /*!< 0x00010000 */
#define HASH_CR_LKEY              HASH_CR_LKEY_Msk

/******************  Bits definition for HASH_STR register  *******************/
#define HASH_STR_NBLW_Pos         (0U)
#define HASH_STR_NBLW_Msk         (0x1FUL << HASH_STR_NBLW_Pos)                 /*!< 0x0000001F */
#define HASH_STR_NBLW             HASH_STR_NBLW_Msk
#define HASH_STR_NBLW_0           (0x01UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000001 */
#define HASH_STR_NBLW_1           (0x02UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000002 */
#define HASH_STR_NBLW_2           (0x04UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000004 */
#define HASH_STR_NBLW_3           (0x08UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000008 */
#define HASH_STR_NBLW_4           (0x10UL << HASH_STR_NBLW_Pos)                 /*!< 0x00000010 */
#define HASH_STR_DCAL_Pos         (8U)
#define HASH_STR_DCAL_Msk         (0x1UL << HASH_STR_DCAL_Pos)                  /*!< 0x00000100 */
#define HASH_STR_DCAL             HASH_STR_DCAL_Msk

/******************  Bits definition for HASH_SHA3CFGR register  *******************/
#define HASH_SHA3CFGR_PADBYTE_Pos (0U)
#define HASH_SHA3CFGR_PADBYTE_Msk (0x7FUL << HASH_SHA3CFGR_PADBYTE_Pos)
#define HASH_SHA3CFGR_PADBYTE      HASH_SHA3CFGR_PADBYTE_Msk
#define HASH_SHA3CFGR_PADCONF_Pos (8U)
#define HASH_SHA3CFGR_PADCONF_Msk (0x1UL << HASH_SHA3CFGR_PADCONF_Pos)
#define HASH_SHA3CFGR_PADCONF      HASH_SHA3CFGR_PADCONF_Msk
#define HASH_SHA3CFGR_SRND_Pos     (9U)
#define HASH_SHA3CFGR_SRND_Msk     (0x1FUL << HASH_SHA3CFGR_SRND_Pos)
#define HASH_SHA3CFGR_SRND         HASH_SHA3CFGR_SRND_Msk
#define HASH_SHA3CFGR_ERND_Pos     (14U)
#define HASH_SHA3CFGR_ERND_Msk     (0x1FUL << HASH_SHA3CFGR_ERND_Pos)
#define HASH_SHA3CFGR_ERND         HASH_SHA3CFGR_ERND_Msk
#define HASH_SHA3CFGR_INRATE_Pos   (19U)
#define HASH_SHA3CFGR_INRATE_Msk   (0x1FUL << HASH_SHA3CFGR_INRATE_Pos)
#define HASH_SHA3CFGR_INRATE       HASH_SHA3CFGR_INRATE_Msk

/******************  Bits definition for HASH_IMR register  *******************/
#define HASH_IMR_DINIE_Pos        (0U)
#define HASH_IMR_DINIE_Msk        (0x1UL << HASH_IMR_DINIE_Pos)                 /*!< 0x00000001 */
#define HASH_IMR_DINIE            HASH_IMR_DINIE_Msk
#define HASH_IMR_DCIE_Pos         (1U)
#define HASH_IMR_DCIE_Msk         (0x1UL << HASH_IMR_DCIE_Pos)                  /*!< 0x00000002 */
#define HASH_IMR_DCIE             HASH_IMR_DCIE_Msk

/******************  Bits definition for HASH_SR register  ********************/
#define HASH_SR_DINIS_Pos         (0U)
#define HASH_SR_DINIS_Msk         (0x1UL << HASH_SR_DINIS_Pos)                  /*!< 0x00000001 */
#define HASH_SR_DINIS             HASH_SR_DINIS_Msk
#define HASH_SR_DCIS_Pos          (1U)
#define HASH_SR_DCIS_Msk          (0x1UL << HASH_SR_DCIS_Pos)                   /*!< 0x00000002 */
#define HASH_SR_DCIS              HASH_SR_DCIS_Msk
#define HASH_SR_DMAS_Pos          (2U)
#define HASH_SR_DMAS_Msk          (0x1UL << HASH_SR_DMAS_Pos)                   /*!< 0x00000004 */
#define HASH_SR_DMAS              HASH_SR_DMAS_Msk
#define HASH_SR_BUSY_Pos          (3U)
#define HASH_SR_BUSY_Msk          (0x1UL << HASH_SR_BUSY_Pos)                   /*!< 0x00000008 */
#define HASH_SR_BUSY              HASH_SR_BUSY_Msk
#define HASH_SR_NBWP_Pos          (9U)
#define HASH_SR_NBWP_Msk          (0x3FUL << HASH_SR_NBWP_Pos)
#define HASH_SR_NBWP              HASH_SR_NBWP_Msk
#define HASH_SR_DINNE_Pos          (15U)
#define HASH_SR_DINNE_Msk          (0x1UL << HASH_SR_DINNE_Pos)
#define HASH_SR_DINNE              HASH_SR_DINNE_Msk
#define HASH_SR_NBWE_Pos          (16U)
#define HASH_SR_NBWE_Msk          (0x3FUL << HASH_SR_NBWE_Pos)
#define HASH_SR_NBWE              HASH_SR_NB_WE_Msk

/**********************  Bit definition for HASH_HWCFGR register  ***************/
#define HASH_HWCFGR_CFG1_Pos  (0U)
#define HASH_HWCFGR_CFG1_Msk  (0xFUL << HASH_HWCFGR_CFG1_Pos)           /*!< 0x0000000F */
#define HASH_HWCFGR_CFG1      HASH_HWCFGR_CFG1_Msk                     /*!< use_mdma generic value (0x1) */

/**********************  Bit definition for HASH_VERR register  *****************/
#define HASH_VERR_VER_Pos      (0U)
#define HASH_VERR_VER_Msk      (0xFFUL << HASH_VERR_VER_Pos)               /*!< 0x0000000FF */
#define HASH_VERR_VER          HASH_VERR_VER_Msk                         /*!<  Revision number */

/**********************  Bit definition for HASH_IPIDR register  ****************/
#define HASH_IPIDR_IPID_Pos       (0U)
#define HASH_IPIDR_IPID_Msk       (0xFFFFFFFFUL << HASH_IPIDR_IPID_Pos)         /*!< 0xFFFFFFFF */
#define HASH_IPIDR_IPID           HASH_IPIDR_IPID_Msk                          /*!< IP Identification */

/**********************  Bit definition for HASH_SIDR register  *****************/
#define HASH_MID_MID_Pos         (0U)
#define HASH_MID_MID_Msk         (0xFFFFFFFFUL << HASH_MID_MID_Pos)           /*!< 0xFFFFFFFF */
#define HASH_MID_MID             HASH_MID_MID_Msk                            /*!< Magic identification */

/******************************************************************************/
/*                                                                            */
/*               Secure Advanced Encryption Standard (SAES)                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SAES_CR register  *********************/
#define SAES_CR_EN_Pos                      (0U)
#define SAES_CR_EN_Msk                      (0x1UL << SAES_CR_EN_Pos)               /*!< 0x00000001 */
#define SAES_CR_EN                          SAES_CR_EN_Msk                          /*!< SAES Enable */
#define SAES_CR_DATATYPE_Pos                (1U)
#define SAES_CR_DATATYPE_Msk                (0x3UL << SAES_CR_DATATYPE_Pos)         /*!< 0x00000006 */
#define SAES_CR_DATATYPE                    SAES_CR_DATATYPE_Msk                    /*!< Data type selection */
#define SAES_CR_DATATYPE_0                  (0x1UL << SAES_CR_DATATYPE_Pos)         /*!< 0x00000002 */
#define SAES_CR_DATATYPE_1                  (0x2UL << SAES_CR_DATATYPE_Pos)         /*!< 0x00000004 */
#define SAES_CR_MODE_Pos                    (3U)
#define SAES_CR_MODE_Msk                    (0x3UL << SAES_CR_MODE_Pos)             /*!< 0x00000018 */
#define SAES_CR_MODE                        SAES_CR_MODE_Msk                        /*!< SAES Mode Of Operation */
#define SAES_CR_MODE_0                      (0x1UL << SAES_CR_MODE_Pos)             /*!< 0x00000008 */
#define SAES_CR_MODE_1                      (0x2UL << SAES_CR_MODE_Pos)             /*!< 0x00000010 */
#define SAES_CR_CHMOD_Pos                   (5U)
#define SAES_CR_CHMOD_Msk                   (0x803UL << SAES_CR_CHMOD_Pos)          /*!< 0x00010060 */
#define SAES_CR_CHMOD                       SAES_CR_CHMOD_Msk                       /*!< SAES Chaining Mode */
#define SAES_CR_CHMOD_0                     (0x001UL << SAES_CR_CHMOD_Pos)          /*!< 0x00000020 */
#define SAES_CR_CHMOD_1                     (0x002UL << SAES_CR_CHMOD_Pos)          /*!< 0x00000040 */
#define SAES_CR_CHMOD_2                     (0x800UL << SAES_CR_CHMOD_Pos)          /*!< 0x00010000 */
#define SAES_CR_ALGOMODE_AES_ECB            ((uint32_t)0x00000000)
#define SAES_CR_ALGOMODE_AES_CBC_Pos        (5U)
#define SAES_CR_ALGOMODE_AES_CBC_Msk        (0x1UL << SAES_CR_ALGOMODE_AES_CBC_Pos) /*!< 0x00000020 */
#define SAES_CR_ALGOMODE_AES_CBC            SAES_CR_ALGOMODE_AES_CBC_Msk
#define SAES_CR_ALGOMODE_AES_CTR_Pos        (6U)
#define SAES_CR_ALGOMODE_AES_CTR_Msk        (0x1UL << SAES_CR_ALGOMODE_AES_CTR_Pos) /*!< 0x00000040 */
#define SAES_CR_ALGOMODE_AES_CTR            SAES_CR_ALGOMODE_AES_CTR_Msk
#define SAES_CR_ALGOMODE_AES_GCM_Pos        (5U)
#define SAES_CR_ALGOMODE_AES_GCM_Msk        (0x3UL << SAES_CR_ALGOMODE_AES_GCM_Pos) /*!< 0x00000060 */
#define SAES_CR_ALGOMODE_AES_GCM            SAES_CR_ALGOMODE_AES_GCM_Msk
#define SAES_CR_ALGOMODE_AES_CCM_Pos        (16U)
#define SAES_CR_ALGOMODE_AES_CCM_Msk        (0x1UL << SAES_CR_ALGOMODE_AES_CCM_Pos) /*!< 0x00010000 */
#define SAES_CR_ALGOMODE_AES_CCM            SAES_CR_ALGOMODE_AES_CCM_Msk
#define SAES_CR_DMAINEN_Pos                 (11U)
#define SAES_CR_DMAINEN_Msk                 (0x1UL << SAES_CR_DMAINEN_Pos)          /*!< 0x00000800 */
#define SAES_CR_DMAINEN                     SAES_CR_DMAINEN_Msk                     /*!< Enable data input phase DMA management  */
#define SAES_CR_DMAOUTEN_Pos                (12U)
#define SAES_CR_DMAOUTEN_Msk                (0x1UL << SAES_CR_DMAOUTEN_Pos)         /*!< 0x00001000 */
#define SAES_CR_DMAOUTEN                    SAES_CR_DMAOUTEN_Msk                    /*!< Enable data output phase DMA management */
#define SAES_CR_GCMPH_Pos                   (13U)
#define SAES_CR_GCMPH_Msk                   (0x3UL << SAES_CR_GCMPH_Pos)            /*!< 0x00006000 */
#define SAES_CR_GCMPH                       SAES_CR_GCMPH_Msk                       /*!< GCM Phase */
#define SAES_CR_GCMPH_0                     (0x1UL << SAES_CR_GCMPH_Pos)            /*!< 0x00002000 */
#define SAES_CR_GCMPH_1                     (0x2UL << SAES_CR_GCMPH_Pos)            /*!< 0x00004000 */
#define SAES_CR_KEYSIZE_Pos                 (18U)
#define SAES_CR_KEYSIZE_Msk                 (0x1UL << SAES_CR_KEYSIZE_Pos)          /*!< 0x00040000 */
#define SAES_CR_KEYSIZE                     SAES_CR_KEYSIZE_Msk                     /*!< Key size selection */
#define SAES_CR_NPBLB_Pos                   (20U)
#define SAES_CR_NPBLB_Msk                   (0xFUL << SAES_CR_NPBLB_Pos)            /*!< 0x00F00000 */
#define SAES_CR_NPBLB                       SAES_CR_NPBLB_Msk                       /*!< Number of padding bytes in payload last block */
#define SAES_CR_NPBLB_0                     (0x1UL << SAES_CR_NPBLB_Pos)            /*!< 0x00100000 */
#define SAES_CR_NPBLB_1                     (0x2UL << SAES_CR_NPBLB_Pos)            /*!< 0x00200000 */
#define SAES_CR_NPBLB_2                     (0x4UL << SAES_CR_NPBLB_Pos)            /*!< 0x00400000 */
#define SAES_CR_NPBLB_3                     (0x8UL << SAES_CR_NPBLB_Pos)            /*!< 0x00800000 */
#define SAES_CR_KEYPROT_Pos                 (19U)
#define SAES_CR_KEYPROT_Msk                 (0x1UL << SAES_CR_KEYPROT_Pos)          /*!< 0x00040000 */
#define SAES_CR_KEYPROT                     SAES_CR_KEYPROT_Msk                     /*!<  Key protection */
#define SAES_CR_KMOD_Pos                    (24U)
#define SAES_CR_KMOD_Msk                    (0x3UL << SAES_CR_KMOD_Pos)             /*!< 0x00000006 */
#define SAES_CR_KMOD                        SAES_CR_KMOD_Msk                        /*!< Key mode selection */
#define SAES_CR_KMOD_0                      (0x1UL << SAES_CR_KMOD_Pos)             /*!< 0x02000000 */
#define SAES_CR_KMOD_1                      (0x2UL << SAES_CR_KMOD_Pos)             /*!< 0x02000000 */
#define SAES_CR_KSHAREID_Pos                (26U)
#define SAES_CR_KSHAREID_Msk                (0x3UL << SAES_CR_KSHAREID_Pos)         /*!< 0x00000006 */
#define SAES_CR_KSHAREID                    SAES_CR_KSHAREID_Msk                    /*!< Key Shared ID */
#define SAES_CR_KEYSEL_Pos                  (28U)
#define SAES_CR_KEYSEL_Msk                  (0x7UL << SAES_CR_KEYSEL_Pos)           /*!< 0x00000006 */
#define SAES_CR_KEYSEL                      SAES_CR_KEYSEL_Msk                      /*!< Key Selection */
#define SAES_CR_KEYSEL_0                    (0x1UL << SAES_CR_KEYSEL_Pos)           /*!< 0x02000000 */
#define SAES_CR_KEYSEL_1                    (0x2UL << SAES_CR_KEYSEL_Pos)           /*!< 0x02000000 */
#define SAES_CR_KEYSEL_2                    (0x4UL << SAES_CR_KEYSEL_Pos)           /*!< 0x02000000 */
#define SAES_CR_IPRST_Pos                   (31U)
#define SAES_CR_IPRST_Msk                   (0x1UL << SAES_CR_IPRST_Pos)            /*!< 0x80000001 */
#define SAES_CR_IPRST                       SAES_CR_IPRST_Msk                       /*!< SAES IP software reset */

/*******************  Bit definition for SAES_SR register  *********************/
#define SAES_SR_CCF_Pos                     (0U)
#define SAES_SR_CCF_Msk                     (0x1UL << SAES_SR_CCF_Pos)              /*!< 0x00000001 */
#define SAES_SR_CCF                         SAES_SR_CCF_Msk                         /*!< Computation Complete Flag */
#define SAES_SR_RDERR_Pos                   (1U)
#define SAES_SR_RDERR_Msk                   (0x1UL << SAES_SR_RDERR_Pos)            /*!< 0x00000002 */
#define SAES_SR_RDERR                       SAES_SR_RDERR_Msk                       /*!< Read Error Flag */
#define SAES_SR_WRERR_Pos                   (2U)
#define SAES_SR_WRERR_Msk                   (0x1UL << SAES_SR_WRERR_Pos)            /*!< 0x00000004 */
#define SAES_SR_WRERR                       SAES_SR_WRERR_Msk                       /*!< Write Error Flag */
#define SAES_SR_BUSY_Pos                    (3U)
#define SAES_SR_BUSY_Msk                    (0x1UL << SAES_SR_BUSY_Pos)             /*!< 0x00000008 */
#define SAES_SR_BUSY                        SAES_SR_BUSY_Msk                        /*!< Busy Flag */
#define SAES_SR_KEYVALID_Pos                (7U)
#define SAES_SR_KEYVALID_Msk                (0x1UL << SAES_SR_KEYVALID_Pos)         /*!< 0x00000008 */
#define SAES_SR_KEYVALID                    SAES_SR_KEYVALID_Msk                    /*!< KEYVALID Flag */

