zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133fxx_ca7.h
/* Montgomery multiplication output data */
#define PKA_MONTGOMERY_MUL_OUT_RESULT             ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Output result */

/* Generic Arithmetic input data */
#define PKA_ARITHMETIC_ALL_OPS_NB_BITS            ((0x408U - PKA_RAM_OFFSET)>>2)   /*!< Input operand number of bits */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP1             ((0xA50U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op1 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP2             ((0xC68U - PKA_RAM_OFFSET)>>2)   /*!< Input operand op2 */
#define PKA_ARITHMETIC_ALL_OPS_IN_OP3             ((0x1088U - PKA_RAM_OFFSET)>>2)  /*!< Input operand op2 */

/* Generic Arithmetic output data */
#define PKA_ARITHMETIC_ALL_OPS_OUT_RESULT         ((0xE78U - PKA_RAM_OFFSET)>>2)   /*!< Output result */

/* PKA functions list */
#define PKA_DEFINE_IN_CMSIS               (1U)                    /*!< i.e. PKA operation define are in CMSIS device not in PKA_HAL header */

#define PKA_MODE_MODULAR_EXP              ((uint32_t)0x00000000U) /*!< Compute Montgomery parameter and modular exponentiation */
#define PKA_MODE_MONTGOMERY_PARAM         ((uint32_t)0x00000001U) /*!< Compute Montgomery parameter only */
#define PKA_MODE_MODULAR_EXP_FAST_MODE    ((uint32_t)0x00000002U) /*!< Compute modular exponentiation only (fast, Montgomery parameter should be loaded) */
#define PKA_MODE_MODULAR_EXP_PROTECT      ((uint32_t)0x00000003U) /*!< Compute modular exponentiation protected */
#define PKA_MODE_RSA_CRT_EXP              ((uint32_t)0x00000007U) /*!< RSA CRT exponentiation */
#define PKA_MODE_MODULAR_INV              ((uint32_t)0x00000008U) /*!< Modular inversion */
#define PKA_MODE_ARITHMETIC_ADD           ((uint32_t)0x00000009U) /*!< Arithmetic addition */
#define PKA_MODE_ARITHMETIC_SUB           ((uint32_t)0x0000000AU) /*!< Arithmetic subtraction */
#define PKA_MODE_ARITHMETIC_MUL           ((uint32_t)0x0000000BU) /*!< Arithmetic multiplication */
#define PKA_MODE_COMPARISON               ((uint32_t)0x0000000CU) /*!< Comparison */
#define PKA_MODE_MODULAR_RED              ((uint32_t)0x0000000DU) /*!< Modular reduction */
#define PKA_MODE_MODULAR_ADD              ((uint32_t)0x0000000EU) /*!< Modular addition */
#define PKA_MODE_MODULAR_SUB              ((uint32_t)0x0000000FU) /*!< Modular subtraction */
#define PKA_MODE_MONTGOMERY_MUL           ((uint32_t)0x00000010U) /*!< Montgomery multiplication */
#define PKA_MODE_ECC_MUL                  ((uint32_t)0x00000020U) /*!< Compute ECC Fp scalar multiplication */
#define PKA_MODE_ECC_COMPLETE_ADD         ((uint32_t)0x00000023U) /*!< ECC complete addition */
#define PKA_MODE_ECDSA_SIGNATURE          ((uint32_t)0x00000024U) /*!< ECDSA signature */
#define PKA_MODE_ECDSA_VERIFICATION       ((uint32_t)0x00000026U) /*!< ECDSA verification */
#define PKA_MODE_DOUBLE_BASE_LADDER       ((uint32_t)0x00000027U) /*!< ECC double base ladder  */
#define PKA_MODE_POINT_CHECK              ((uint32_t)0x00000028U) /*!< Point on elliptic curve check */
#define PKA_MODE_ECC_PROJECTIVE_AFF       ((uint32_t)0x0000002FU) /*!< ECC projective to affine */

/******************************************************************************/
/*                                                                            */
/*                      Memory Cipher Engine (LTDC)                           */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for MCE_CR register  ********************/

#define MCE_CR_GLOCK_Pos            (0U)
#define MCE_CR_GLOCK_Msk            (0x1UL << MCE_CR_GLOCK_Pos)                 /*!< 0x00000001 */
#define MCE_CR_GLOCK                MCE_CR_GLOCK_Msk                           /*!< Global lock */
#define MCE_CR_MKLOCK_Pos           (1U)
#define MCE_CR_MKLOCK_Msk           (0x1UL << MCE_CR_MKLOCK_Pos)                /*!< 0x00000002 */
#define MCE_CR_MKLOCK               MCE_CR_MKLOCK_Msk                          /*!< Master keys lock */

/********************  Bit definition for MCE_SR register  ********************/

#define MCE_SR_MKVALID_Pos          (0U)
#define MCE_SR_MKVALID_Msk          (0x1UL << MCE_SR_MKVALID_Pos)               /*!< 0x00000001 */
#define MCE_SR_MKVALID              MCE_SR_MKVALID_Msk                         /*!< Master key valid */
#define MCE_SR_ENCDIS_Pos           (4U)
#define MCE_SR_ENCDIS_Msk           (0x1UL << MCE_SR_ENCDIS_Pos)               /*!< 0x00000010 */
#define MCE_SR_ENCDIS               MCE_SR_ENCDIS_Msk                         /*!< Encryption disabled */

/********************  Bit definition for MCE_IASR register  ******************/

#define MCE_IASR_CAEF_Pos           (0U)
#define MCE_IASR_CAEF_Msk           (0x1UL << MCE_IASR_CAEF_Pos)                /*!< 0x00000001 */
#define MCE_IASR_CAEF               MCE_IASR_CAEF_Msk                          /*!< Configuration access error flag */

/********************  Bit definition for MCE_IACR register  ******************/

#define MCE_IACR_CAEF_Pos           (0U)
#define MCE_IACR_CAEF_Msk           (0x1UL << MCE_IACR_CAEF_Pos)                /*!< 0x00000001 */
#define MCE_IACR_CAEF               MCE_IACR_CAEF_Msk                          /*!< Configuration access error flag */

/********************  Bit definition for MCE_IAIER register  *****************/

#define MCE_IAIER_CAEIE_Pos         (0U)
#define MCE_IAIER_CAEIE_Msk         (0x1UL << MCE_IAIER_CAEIE_Pos)              /*!< 0x00000001 */
#define MCE_IAIER_CAEIE             MCE_IAIER_CAEIE_Msk                        /*!< Configuration access error interrupt enable */

/********************  Bit definition for MCE_PRIVCFGR register  **************/

#define MCE_PRIVCFGR_PRIV_Pos       (0U)
#define MCE_PRIVCFGR_PRIV_Msk       (0x1UL << MCE_PRIVCFGR_PRIV_Pos)            /*!< 0x00000001 */
#define MCE_PRIVCFGR_PRIV           MCE_PRIVCFGR_PRIV_Msk                      /*!< Privileged configuration */

/********************  Bit definition for MCE_REGCR register  *****************/

#define MCE_REGCR_BREN_Pos          (0U)
#define MCE_REGCR_BREN_Msk          (0x1UL << MCE_REGCR_BREN_Pos)               /*!< 0x00000001 */
#define MCE_REGCR_BREN              MCE_REGCR_BREN_Msk                         /*!< Base region enable */
#define MCE_REGCR_ENC_Pos           (15U)
#define MCE_REGCR_ENC_Msk           (0x1UL << MCE_REGCR_ENC_Pos)                /*!< 0x00008000 */
#define MCE_REGCR_ENC               MCE_REGCR_ENC_Msk                          /*!< Encrypted region */

