zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133fxx_ca7.h
/************  Bit definition for RCC_MP_S_APB3LPENSETR register  *************/
#define RCC_MP_S_APB3LPENSETR_SYSCFGLPEN_Pos       (0U)
#define RCC_MP_S_APB3LPENSETR_SYSCFGLPEN_Msk       (0x1UL << RCC_MP_S_APB3LPENSETR_SYSCFGLPEN_Pos)      /*!< 0x00000001 */
#define RCC_MP_S_APB3LPENSETR_SYSCFGLPEN           RCC_MP_S_APB3LPENSETR_SYSCFGLPEN_Msk                /*!< SYSCFG peripheral clocks enable during CSleep mode Set by (secure) software. */

/************  Bit definition for RCC_MP_S_APB3LPENCLRR register  *************/
#define RCC_MP_S_APB3LPENCLRR_SYSCFGLPEN_Pos       (0U)
#define RCC_MP_S_APB3LPENCLRR_SYSCFGLPEN_Msk       (0x1UL << RCC_MP_S_APB3LPENCLRR_SYSCFGLPEN_Pos)      /*!< 0x00000001 */
#define RCC_MP_S_APB3LPENCLRR_SYSCFGLPEN           RCC_MP_S_APB3LPENCLRR_SYSCFGLPEN_Msk                /*!< SYSCFG peripheral clocks enable during CSleep mode Cleared by (secure) software. */

/************  Bit definition for RCC_MP_NS_APB3LPENSETR register  ************/
#define RCC_MP_NS_APB3LPENSETR_SYSCFGLPEN_Pos      (0U)
#define RCC_MP_NS_APB3LPENSETR_SYSCFGLPEN_Msk      (0x1UL << RCC_MP_NS_APB3LPENSETR_SYSCFGLPEN_Pos)     /*!< 0x00000001 */
#define RCC_MP_NS_APB3LPENSETR_SYSCFGLPEN          RCC_MP_NS_APB3LPENSETR_SYSCFGLPEN_Msk               /*!< SYSCFG peripheral clocks enable during CSleep mode Set by software. */

/************  Bit definition for RCC_MP_NS_APB3LPENCLRR register  ************/
#define RCC_MP_NS_APB3LPENCLRR_SYSCFGLPEN_Pos      (0U)
#define RCC_MP_NS_APB3LPENCLRR_SYSCFGLPEN_Msk      (0x1UL << RCC_MP_NS_APB3LPENCLRR_SYSCFGLPEN_Pos)     /*!< 0x00000001 */
#define RCC_MP_NS_APB3LPENCLRR_SYSCFGLPEN          RCC_MP_NS_APB3LPENCLRR_SYSCFGLPEN_Msk               /*!< SYSCFG peripheral clocks enable during CSleep mode Cleared by software. */

/*************  Bit definition for RCC_MP_APB4LPENSETR register  **************/
#define RCC_MP_APB4LPENSETR_DCMIPPLPEN_Pos         (1U)
#define RCC_MP_APB4LPENSETR_DCMIPPLPEN_Msk         (0x1UL << RCC_MP_APB4LPENSETR_DCMIPPLPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_APB4LPENSETR_DCMIPPLPEN             RCC_MP_APB4LPENSETR_DCMIPPLPEN_Msk                  /*!< DCMIPP peripheral clocks enable during CSleep mode If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Pos       (8U)
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Msk       (0x1UL << RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Pos)      /*!< 0x00000100 */
#define RCC_MP_APB4LPENSETR_DDRPERFMLPEN           RCC_MP_APB4LPENSETR_DDRPERFMLPEN_Msk                /*!< DDRPERFM APB clock enable during CSleep mode Set by software. */
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Pos       (15U)
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Msk       (0x1UL << RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Pos)      /*!< 0x00008000 */
#define RCC_MP_APB4LPENSETR_IWDG2APBLPEN           RCC_MP_APB4LPENSETR_IWDG2APBLPEN_Msk                /*!< IWDG2 APB clock enable during CSleep mode Set by software. */
#define RCC_MP_APB4LPENSETR_USBPHYLPEN_Pos         (16U)
#define RCC_MP_APB4LPENSETR_USBPHYLPEN_Msk         (0x1UL << RCC_MP_APB4LPENSETR_USBPHYLPEN_Pos)        /*!< 0x00010000 */
#define RCC_MP_APB4LPENSETR_USBPHYLPEN             RCC_MP_APB4LPENSETR_USBPHYLPEN_Msk                  /*!< USBPHYC peripheral clocks enable during CSleep mode If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB4LPENSETR_STGENROLPEN_Pos        (20U)
#define RCC_MP_APB4LPENSETR_STGENROLPEN_Msk        (0x1UL << RCC_MP_APB4LPENSETR_STGENROLPEN_Pos)       /*!< 0x00100000 */
#define RCC_MP_APB4LPENSETR_STGENROLPEN            RCC_MP_APB4LPENSETR_STGENROLPEN_Msk                 /*!< STGEN read-only interface peripheral clocks enable during CSleep mode Set by software. The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register. */
#define RCC_MP_APB4LPENSETR_STGENROSTPEN_Pos       (21U)
#define RCC_MP_APB4LPENSETR_STGENROSTPEN_Msk       (0x1UL << RCC_MP_APB4LPENSETR_STGENROSTPEN_Pos)      /*!< 0x00200000 */
#define RCC_MP_APB4LPENSETR_STGENROSTPEN           RCC_MP_APB4LPENSETR_STGENROSTPEN_Msk                /*!< STGEN read-only interface peripheral clocks enable during CStop mode Set by software. The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register. */

/*************  Bit definition for RCC_MP_APB4LPENCLRR register  **************/
#define RCC_MP_APB4LPENCLRR_DCMIPPLPEN_Pos         (1U)
#define RCC_MP_APB4LPENCLRR_DCMIPPLPEN_Msk         (0x1UL << RCC_MP_APB4LPENCLRR_DCMIPPLPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_APB4LPENCLRR_DCMIPPLPEN             RCC_MP_APB4LPENCLRR_DCMIPPLPEN_Msk                  /*!< DCMIPP peripheral clocks enable during CSleep mode If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Pos       (8U)
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Msk       (0x1UL << RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Pos)      /*!< 0x00000100 */
#define RCC_MP_APB4LPENCLRR_DDRPERFMLPEN           RCC_MP_APB4LPENCLRR_DDRPERFMLPEN_Msk                /*!< DDRPERFM APB clock enable during CSleep mode Cleared by software. */
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Pos       (15U)
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Msk       (0x1UL << RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Pos)      /*!< 0x00008000 */
#define RCC_MP_APB4LPENCLRR_IWDG2APBLPEN           RCC_MP_APB4LPENCLRR_IWDG2APBLPEN_Msk                /*!< IWDG2 APB clock enable during CSleep mode Cleared by software. */
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN_Pos         (16U)
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN_Msk         (0x1UL << RCC_MP_APB4LPENCLRR_USBPHYLPEN_Pos)        /*!< 0x00010000 */
#define RCC_MP_APB4LPENCLRR_USBPHYLPEN             RCC_MP_APB4LPENCLRR_USBPHYLPEN_Msk                  /*!< USBPHYC peripheral clocks enable during CSleep mode If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB4LPENCLRR_STGENROLPEN_Pos        (20U)
#define RCC_MP_APB4LPENCLRR_STGENROLPEN_Msk        (0x1UL << RCC_MP_APB4LPENCLRR_STGENROLPEN_Pos)       /*!< 0x00100000 */
#define RCC_MP_APB4LPENCLRR_STGENROLPEN            RCC_MP_APB4LPENCLRR_STGENROLPEN_Msk                 /*!< STGEN read-only interface peripheral clocks enable during CSleep mode Cleared by software. The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register. */
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN_Pos       (21U)
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN_Msk       (0x1UL << RCC_MP_APB4LPENCLRR_STGENROSTPEN_Pos)      /*!< 0x00200000 */
#define RCC_MP_APB4LPENCLRR_STGENROSTPEN           RCC_MP_APB4LPENCLRR_STGENROSTPEN_Msk                /*!< STGEN read-only interface peripheral clocks enable during CStop mode Cleared by software. The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register. */

/************  Bit definition for RCC_MP_S_APB4LPENSETR register  *************/
#define RCC_MP_S_APB4LPENSETR_LTDCLPEN_Pos         (0U)
#define RCC_MP_S_APB4LPENSETR_LTDCLPEN_Msk         (0x1UL << RCC_MP_S_APB4LPENSETR_LTDCLPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_S_APB4LPENSETR_LTDCLPEN             RCC_MP_S_APB4LPENSETR_LTDCLPEN_Msk                  /*!< LTDC peripheral clocks enable during CSleep mode Set by (secure) software. */

/************  Bit definition for RCC_MP_S_APB4LPENCLRR register  *************/
#define RCC_MP_S_APB4LPENCLRR_LTDCLPEN_Pos         (0U)
#define RCC_MP_S_APB4LPENCLRR_LTDCLPEN_Msk         (0x1UL << RCC_MP_S_APB4LPENCLRR_LTDCLPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_S_APB4LPENCLRR_LTDCLPEN             RCC_MP_S_APB4LPENCLRR_LTDCLPEN_Msk                  /*!< LTDC peripheral clocks enable during CSleep mode Cleared by (secure) software. */

/************  Bit definition for RCC_MP_NS_APB4LPENSETR register  ************/
#define RCC_MP_NS_APB4LPENSETR_LTDCLPEN_Pos        (0U)
#define RCC_MP_NS_APB4LPENSETR_LTDCLPEN_Msk        (0x1UL << RCC_MP_NS_APB4LPENSETR_LTDCLPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_NS_APB4LPENSETR_LTDCLPEN            RCC_MP_NS_APB4LPENSETR_LTDCLPEN_Msk                 /*!< LTDC peripheral clocks enable during CSleep mode Set by software. */

/************  Bit definition for RCC_MP_NS_APB4LPENCLRR register  ************/
#define RCC_MP_NS_APB4LPENCLRR_LTDCLPEN_Pos        (0U)
#define RCC_MP_NS_APB4LPENCLRR_LTDCLPEN_Msk        (0x1UL << RCC_MP_NS_APB4LPENCLRR_LTDCLPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_NS_APB4LPENCLRR_LTDCLPEN            RCC_MP_NS_APB4LPENCLRR_LTDCLPEN_Msk                 /*!< LTDC peripheral clocks enable during CSleep mode Cleared by software. */

