zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133fxx_ca7.h
/****************  Bit definition for RCC_AHB6SECSR register  *****************/
#define RCC_AHB6SECSR_MCESECF_Pos                  (1U)
#define RCC_AHB6SECSR_MCESECF_Msk                  (0x1UL << RCC_AHB6SECSR_MCESECF_Pos)                 /*!< 0x00000002 */
#define RCC_AHB6SECSR_MCESECF                      RCC_AHB6SECSR_MCESECF_Msk                           /*!< MCE block secure status flag This bit reflects the MCE block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB6SECSR_ETH1SECF_Pos                 (7U)
#define RCC_AHB6SECSR_ETH1SECF_Msk                 (0x1FUL << RCC_AHB6SECSR_ETH1SECF_Pos)               /*!< 0x00000F80 */
#define RCC_AHB6SECSR_ETH1SECF                     RCC_AHB6SECSR_ETH1SECF_Msk                          /*!< ETH1 block secure status flag This field reflects the ETH1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB6SECSR_ETH1SECF_0                   (0x1UL << RCC_AHB6SECSR_ETH1SECF_Pos)               /*!< 0x00000080 */
#define RCC_AHB6SECSR_ETH1SECF_1                   (0x2UL << RCC_AHB6SECSR_ETH1SECF_Pos)              /*!< 0x00000100 */
#define RCC_AHB6SECSR_ETH1SECF_2                   (0x4UL << RCC_AHB6SECSR_ETH1SECF_Pos)              /*!< 0x00000200 */
#define RCC_AHB6SECSR_ETH1SECF_3                   (0x8UL << RCC_AHB6SECSR_ETH1SECF_Pos)              /*!< 0x00000400 */
#define RCC_AHB6SECSR_ETH1SECF_4                   (0x10UL << RCC_AHB6SECSR_ETH1SECF_Pos)              /*!< 0x00000800 */
#define RCC_AHB6SECSR_FMCSECF_Pos                  (12U)
#define RCC_AHB6SECSR_FMCSECF_Msk                  (0x1UL << RCC_AHB6SECSR_FMCSECF_Pos)                 /*!< 0x00001000 */
#define RCC_AHB6SECSR_FMCSECF                      RCC_AHB6SECSR_FMCSECF_Msk                           /*!< FMC block secure status flag This bit reflects the FMC block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB6SECSR_QSPISECF_Pos                 (14U)
#define RCC_AHB6SECSR_QSPISECF_Msk                 (0x1UL << RCC_AHB6SECSR_QSPISECF_Pos)                /*!< 0x00004000 */
#define RCC_AHB6SECSR_QSPISECF                     RCC_AHB6SECSR_QSPISECF_Msk                          /*!< QSPI block secure status flag This bit reflects the QSPI block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB6SECSR_SDMMC1SECF_Pos               (16U)
#define RCC_AHB6SECSR_SDMMC1SECF_Msk               (0x1UL << RCC_AHB6SECSR_SDMMC1SECF_Pos)              /*!< 0x00010000 */
#define RCC_AHB6SECSR_SDMMC1SECF                   RCC_AHB6SECSR_SDMMC1SECF_Msk                        /*!< SDMMC1 block secure status flag This bit reflects the SDMMC1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB6SECSR_SDMMC2SECF_Pos               (17U)
#define RCC_AHB6SECSR_SDMMC2SECF_Msk               (0x1UL << RCC_AHB6SECSR_SDMMC2SECF_Pos)              /*!< 0x00020000 */
#define RCC_AHB6SECSR_SDMMC2SECF                   RCC_AHB6SECSR_SDMMC2SECF_Msk                        /*!< SDMMC2 block secure status flag This bit reflects the SDMMC2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB6SECSR_ETH2SECF_Pos                 (27U)
#define RCC_AHB6SECSR_ETH2SECF_Msk                 (0x1FUL << RCC_AHB6SECSR_ETH2SECF_Pos)               /*!< 0xF8000000 */
#define RCC_AHB6SECSR_ETH2SECF                     RCC_AHB6SECSR_ETH2SECF_Msk                          /*!< ETH2 block secure status flag This field reflects the ETH2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB6SECSR_ETH2SECF_0                   (0x1UL << RCC_AHB6SECSR_ETH2SECF_Pos)          /*!< 0x08000000 */
#define RCC_AHB6SECSR_ETH2SECF_1                   (0x2UL << RCC_AHB6SECSR_ETH2SECF_Pos)         /*!< 0x10000000 */
#define RCC_AHB6SECSR_ETH2SECF_2                   (0x4UL << RCC_AHB6SECSR_ETH2SECF_Pos)         /*!< 0x20000000 */
#define RCC_AHB6SECSR_ETH2SECF_3                   (0x8UL << RCC_AHB6SECSR_ETH2SECF_Pos)         /*!< 0x40000000 */
#define RCC_AHB6SECSR_ETH2SECF_4                   (0x10UL << RCC_AHB6SECSR_ETH2SECF_Pos)         /*!< 0x80000000 */

/*******************  Bit definition for RCC_VERR register  *******************/
#define RCC_VERR_MINREV_Pos                        (0U)
#define RCC_VERR_MINREV_Msk                        (0xFUL << RCC_VERR_MINREV_Pos)                       /*!< 0x0000000F */
#define RCC_VERR_MINREV                            RCC_VERR_MINREV_Msk                                 /*!< Minor Revision of the IP */
#define RCC_VERR_MINREV_0                          (0x1UL << RCC_VERR_MINREV_Pos)                       /*!< 0x00000001 */
#define RCC_VERR_MINREV_1                          (0x2UL << RCC_VERR_MINREV_Pos)                       /*!< 0x00000002 */
#define RCC_VERR_MINREV_2                          (0x4UL << RCC_VERR_MINREV_Pos)                       /*!< 0x00000004 */
#define RCC_VERR_MINREV_3                          (0x8UL << RCC_VERR_MINREV_Pos)                       /*!< 0x00000008 */
#define RCC_VERR_MAJREV_Pos                        (4U)
#define RCC_VERR_MAJREV_Msk                        (0xFUL << RCC_VERR_MAJREV_Pos)                       /*!< 0x000000F0 */
#define RCC_VERR_MAJREV                            RCC_VERR_MAJREV_Msk                                 /*!< Major Revision of the IP */
#define RCC_VERR_MAJREV_0                          (0x1UL << RCC_VERR_MAJREV_Pos)                      /*!< 0x00000010 */
#define RCC_VERR_MAJREV_1                          (0x2UL << RCC_VERR_MAJREV_Pos)                      /*!< 0x00000020 */
#define RCC_VERR_MAJREV_2                          (0x4UL << RCC_VERR_MAJREV_Pos)                      /*!< 0x00000040 */
#define RCC_VERR_MAJREV_3                          (0x8UL << RCC_VERR_MAJREV_Pos)                      /*!< 0x00000080 */

/*******************  Bit definition for RCC_IDR register  ********************/
#define RCC_IDR_ID_Pos                             (0U)
#define RCC_IDR_ID_Msk                             (0xFFFFFFFFUL << RCC_IDR_ID_Pos)                     /*!< 0xFFFFFFFF */
#define RCC_IDR_ID                                 RCC_IDR_ID_Msk                                      /*!< Identifier of the RCC */
#define RCC_IDR_ID_0                               (0x1UL << RCC_IDR_ID_Pos)                            /*!< 0x00000001 */
#define RCC_IDR_ID_1                               (0x2UL << RCC_IDR_ID_Pos)                            /*!< 0x00000002 */
#define RCC_IDR_ID_2                               (0x4UL << RCC_IDR_ID_Pos)                            /*!< 0x00000004 */
#define RCC_IDR_ID_3                               (0x8UL << RCC_IDR_ID_Pos)                            /*!< 0x00000008 */
#define RCC_IDR_ID_4                               (0x10UL << RCC_IDR_ID_Pos)                           /*!< 0x00000010 */
#define RCC_IDR_ID_5                               (0x20UL << RCC_IDR_ID_Pos)                           /*!< 0x00000020 */
#define RCC_IDR_ID_6                               (0x40UL << RCC_IDR_ID_Pos)                           /*!< 0x00000040 */
#define RCC_IDR_ID_7                               (0x80UL << RCC_IDR_ID_Pos)                           /*!< 0x00000080 */
#define RCC_IDR_ID_8                               (0x100UL << RCC_IDR_ID_Pos)                          /*!< 0x00000100 */
#define RCC_IDR_ID_9                               (0x200UL << RCC_IDR_ID_Pos)                          /*!< 0x00000200 */
#define RCC_IDR_ID_10                              (0x400UL << RCC_IDR_ID_Pos)                          /*!< 0x00000400 */
#define RCC_IDR_ID_11                              (0x800UL << RCC_IDR_ID_Pos)                          /*!< 0x00000800 */
#define RCC_IDR_ID_12                              (0x1000UL << RCC_IDR_ID_Pos)                         /*!< 0x00001000 */
#define RCC_IDR_ID_13                              (0x2000UL << RCC_IDR_ID_Pos)                         /*!< 0x00002000 */
#define RCC_IDR_ID_14                              (0x4000UL << RCC_IDR_ID_Pos)                         /*!< 0x00004000 */
#define RCC_IDR_ID_15                              (0x8000UL << RCC_IDR_ID_Pos)                         /*!< 0x00008000 */
#define RCC_IDR_ID_16                              (0x10000UL << RCC_IDR_ID_Pos)                        /*!< 0x00010000 */
#define RCC_IDR_ID_17                              (0x20000UL << RCC_IDR_ID_Pos)                        /*!< 0x00020000 */
#define RCC_IDR_ID_18                              (0x40000UL << RCC_IDR_ID_Pos)                        /*!< 0x00040000 */
#define RCC_IDR_ID_19                              (0x80000UL << RCC_IDR_ID_Pos)                        /*!< 0x00080000 */
#define RCC_IDR_ID_20                              (0x100000UL << RCC_IDR_ID_Pos)                       /*!< 0x00100000 */
#define RCC_IDR_ID_21                              (0x200000UL << RCC_IDR_ID_Pos)                       /*!< 0x00200000 */
#define RCC_IDR_ID_22                              (0x400000UL << RCC_IDR_ID_Pos)                       /*!< 0x00400000 */
#define RCC_IDR_ID_23                              (0x800000UL << RCC_IDR_ID_Pos)                       /*!< 0x00800000 */
#define RCC_IDR_ID_24                              (0x1000000UL << RCC_IDR_ID_Pos)                      /*!< 0x01000000 */
#define RCC_IDR_ID_25                              (0x2000000UL << RCC_IDR_ID_Pos)                      /*!< 0x02000000 */
#define RCC_IDR_ID_26                              (0x4000000UL << RCC_IDR_ID_Pos)                      /*!< 0x04000000 */
#define RCC_IDR_ID_27                              (0x8000000UL << RCC_IDR_ID_Pos)                      /*!< 0x08000000 */
#define RCC_IDR_ID_28                              (0x10000000UL << RCC_IDR_ID_Pos)                     /*!< 0x10000000 */
#define RCC_IDR_ID_29                              (0x20000000UL << RCC_IDR_ID_Pos)                     /*!< 0x20000000 */
#define RCC_IDR_ID_30                              (0x40000000UL << RCC_IDR_ID_Pos)                     /*!< 0x40000000 */
#define RCC_IDR_ID_31                              (0x80000000UL << RCC_IDR_ID_Pos)                     /*!< 0x80000000 */

/*******************  Bit definition for RCC_SIDR register  *******************/
#define RCC_SIDR_SID_Pos                           (0U)
#define RCC_SIDR_SID_Msk                           (0xFFFFFFFFUL << RCC_SIDR_SID_Pos)                   /*!< 0xFFFFFFFF */
#define RCC_SIDR_SID                               RCC_SIDR_SID_Msk                                    /*!< Decoding space is 4 kbytes */
#define RCC_SIDR_SID_0                             (0x1UL << RCC_SIDR_SID_Pos)                          /*!< 0x00000001 */
#define RCC_SIDR_SID_1                             (0x2UL << RCC_SIDR_SID_Pos)                          /*!< 0x00000002 */
#define RCC_SIDR_SID_2                             (0x4UL << RCC_SIDR_SID_Pos)                          /*!< 0x00000004 */
#define RCC_SIDR_SID_3                             (0x8UL << RCC_SIDR_SID_Pos)                          /*!< 0x00000008 */
#define RCC_SIDR_SID_4                             (0x10UL << RCC_SIDR_SID_Pos)                         /*!< 0x00000010 */
#define RCC_SIDR_SID_5                             (0x20UL << RCC_SIDR_SID_Pos)                         /*!< 0x00000020 */
#define RCC_SIDR_SID_6                             (0x40UL << RCC_SIDR_SID_Pos)                         /*!< 0x00000040 */
#define RCC_SIDR_SID_7                             (0x80UL << RCC_SIDR_SID_Pos)                         /*!< 0x00000080 */
#define RCC_SIDR_SID_8                             (0x100UL << RCC_SIDR_SID_Pos)                        /*!< 0x00000100 */
#define RCC_SIDR_SID_9                             (0x200UL << RCC_SIDR_SID_Pos)                        /*!< 0x00000200 */
#define RCC_SIDR_SID_10                            (0x400UL << RCC_SIDR_SID_Pos)                        /*!< 0x00000400 */
#define RCC_SIDR_SID_11                            (0x800UL << RCC_SIDR_SID_Pos)                        /*!< 0x00000800 */
#define RCC_SIDR_SID_12                            (0x1000UL << RCC_SIDR_SID_Pos)                       /*!< 0x00001000 */
#define RCC_SIDR_SID_13                            (0x2000UL << RCC_SIDR_SID_Pos)                       /*!< 0x00002000 */
#define RCC_SIDR_SID_14                            (0x4000UL << RCC_SIDR_SID_Pos)                       /*!< 0x00004000 */
#define RCC_SIDR_SID_15                            (0x8000UL << RCC_SIDR_SID_Pos)                       /*!< 0x00008000 */
#define RCC_SIDR_SID_16                            (0x10000UL << RCC_SIDR_SID_Pos)                      /*!< 0x00010000 */
#define RCC_SIDR_SID_17                            (0x20000UL << RCC_SIDR_SID_Pos)                      /*!< 0x00020000 */
#define RCC_SIDR_SID_18                            (0x40000UL << RCC_SIDR_SID_Pos)                      /*!< 0x00040000 */
#define RCC_SIDR_SID_19                            (0x80000UL << RCC_SIDR_SID_Pos)                      /*!< 0x00080000 */
#define RCC_SIDR_SID_20                            (0x100000UL << RCC_SIDR_SID_Pos)                     /*!< 0x00100000 */
#define RCC_SIDR_SID_21                            (0x200000UL << RCC_SIDR_SID_Pos)                     /*!< 0x00200000 */
#define RCC_SIDR_SID_22                            (0x400000UL << RCC_SIDR_SID_Pos)                     /*!< 0x00400000 */
#define RCC_SIDR_SID_23                            (0x800000UL << RCC_SIDR_SID_Pos)                     /*!< 0x00800000 */
#define RCC_SIDR_SID_24                            (0x1000000UL << RCC_SIDR_SID_Pos)                    /*!< 0x01000000 */
#define RCC_SIDR_SID_25                            (0x2000000UL << RCC_SIDR_SID_Pos)                    /*!< 0x02000000 */
#define RCC_SIDR_SID_26                            (0x4000000UL << RCC_SIDR_SID_Pos)                    /*!< 0x04000000 */
#define RCC_SIDR_SID_27                            (0x8000000UL << RCC_SIDR_SID_Pos)                    /*!< 0x08000000 */
#define RCC_SIDR_SID_28                            (0x10000000UL << RCC_SIDR_SID_Pos)                   /*!< 0x10000000 */
#define RCC_SIDR_SID_29                            (0x20000000UL << RCC_SIDR_SID_Pos)                   /*!< 0x20000000 */
#define RCC_SIDR_SID_30                            (0x40000000UL << RCC_SIDR_SID_Pos)                   /*!< 0x40000000 */
#define RCC_SIDR_SID_31                            (0x80000000UL << RCC_SIDR_SID_Pos)                   /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos    (2U)
#define RNG_CR_RNGEN_Msk    (0x1UL << RNG_CR_RNGEN_Pos)                         /*!< 0x00000004 */
#define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk
#define RNG_CR_IE_Pos       (3U)
#define RNG_CR_IE_Msk       (0x1UL << RNG_CR_IE_Pos)                            /*!< 0x00000008 */
#define RNG_CR_IE           RNG_CR_IE_Msk
#define RNG_CR_CED_Pos      (5U)
#define RNG_CR_CED_Msk      (0x1UL << RNG_CR_CED_Pos)                           /*!< 0x00000020 */
#define RNG_CR_CED          RNG_CR_CED_Msk
#define RNG_CR_ARDIS_Pos                    (7U)
#define RNG_CR_ARDIS_Msk                    (0x1UL << RNG_CR_ARDIS_Pos)
#define RNG_CR_ARDIS                        RNG_CR_ARDIS_Msk
#define RNG_CR_RNG_CONFIG3_Pos              (8U)
#define RNG_CR_RNG_CONFIG3_Msk              (0xFUL << RNG_CR_RNG_CONFIG3_Pos)
#define RNG_CR_RNG_CONFIG3                  RNG_CR_RNG_CONFIG3_Msk
#define RNG_CR_NISTC_Pos                    (12U)
#define RNG_CR_NISTC_Msk                    (0x1UL << RNG_CR_NISTC_Pos)
#define RNG_CR_NISTC                        RNG_CR_NISTC_Msk
#define RNG_CR_RNG_CONFIG2_Pos              (13U)
#define RNG_CR_RNG_CONFIG2_Msk              (0x7UL << RNG_CR_RNG_CONFIG2_Pos)
#define RNG_CR_RNG_CONFIG2                  RNG_CR_RNG_CONFIG2_Msk
#define RNG_CR_CLKDIV_Pos                   (16U)
#define RNG_CR_CLKDIV_Msk                   (0xFUL << RNG_CR_CLKDIV_Pos)
#define RNG_CR_CLKDIV                       RNG_CR_CLKDIV_Msk
#define RNG_CR_CLKDIV_0                     (0x1UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00010000 */
#define RNG_CR_CLKDIV_1                     (0x2UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00020000 */
#define RNG_CR_CLKDIV_2                     (0x4UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00040000 */
#define RNG_CR_CLKDIV_3                     (0x8UL << RNG_CR_CLKDIV_Pos)            /*!< 0x00080000 */
#define RNG_CR_RNG_CONFIG1_Pos              (20U)
#define RNG_CR_RNG_CONFIG1_Msk              (0x3FUL << RNG_CR_RNG_CONFIG1_Pos)
#define RNG_CR_RNG_CONFIG1                  RNG_CR_RNG_CONFIG1_Msk
#define RNG_CR_CONDRST_Pos                  (30U)
#define RNG_CR_CONDRST_Msk                  (0x1UL << RNG_CR_CONDRST_Pos)
#define RNG_CR_CONDRST                      RNG_CR_CONDRST_Msk
#define RNG_CR_CONFIGLOCK_Pos               (31U)
#define RNG_CR_CONFIGLOCK_Msk               (0x1UL << RNG_CR_CONFIGLOCK_Pos)
#define RNG_CR_CONFIGLOCK                   RNG_CR_CONFIGLOCK_Msk

