zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133fxx_ca7.h
/********************  Bit definition for USB_OTG_DCTL register  ********************/
#define USB_OTG_DCTL_RWUSIG_Pos                  (0U)
#define USB_OTG_DCTL_RWUSIG_Msk                  (0x1UL << USB_OTG_DCTL_RWUSIG_Pos) /*!< 0x00000001 */
#define USB_OTG_DCTL_RWUSIG                      USB_OTG_DCTL_RWUSIG_Msk       /*!< Remote wakeup signaling */
#define USB_OTG_DCTL_SDIS_Pos                    (1U)
#define USB_OTG_DCTL_SDIS_Msk                    (0x1UL << USB_OTG_DCTL_SDIS_Pos) /*!< 0x00000002 */
#define USB_OTG_DCTL_SDIS                        USB_OTG_DCTL_SDIS_Msk         /*!< Soft disconnect         */
#define USB_OTG_DCTL_GINSTS_Pos                  (2U)
#define USB_OTG_DCTL_GINSTS_Msk                  (0x1UL << USB_OTG_DCTL_GINSTS_Pos) /*!< 0x00000004 */
#define USB_OTG_DCTL_GINSTS                      USB_OTG_DCTL_GINSTS_Msk       /*!< Global IN NAK status    */
#define USB_OTG_DCTL_GONSTS_Pos                  (3U)
#define USB_OTG_DCTL_GONSTS_Msk                  (0x1UL << USB_OTG_DCTL_GONSTS_Pos) /*!< 0x00000008 */
#define USB_OTG_DCTL_GONSTS                      USB_OTG_DCTL_GONSTS_Msk       /*!< Global OUT NAK status   */

#define USB_OTG_DCTL_TCTL_Pos                    (4U)
#define USB_OTG_DCTL_TCTL_Msk                    (0x7UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000070 */
#define USB_OTG_DCTL_TCTL                        USB_OTG_DCTL_TCTL_Msk         /*!< Test control */
#define USB_OTG_DCTL_TCTL_0                      (0x1UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000010 */
#define USB_OTG_DCTL_TCTL_1                      (0x2UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000020 */
#define USB_OTG_DCTL_TCTL_2                      (0x4UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000040 */
#define USB_OTG_DCTL_SGINAK_Pos                  (7U)
#define USB_OTG_DCTL_SGINAK_Msk                  (0x1UL << USB_OTG_DCTL_SGINAK_Pos) /*!< 0x00000080 */
#define USB_OTG_DCTL_SGINAK                      USB_OTG_DCTL_SGINAK_Msk       /*!< Set global IN NAK         */
#define USB_OTG_DCTL_CGINAK_Pos                  (8U)
#define USB_OTG_DCTL_CGINAK_Msk                  (0x1UL << USB_OTG_DCTL_CGINAK_Pos) /*!< 0x00000100 */
#define USB_OTG_DCTL_CGINAK                      USB_OTG_DCTL_CGINAK_Msk       /*!< Clear global IN NAK       */
#define USB_OTG_DCTL_SGONAK_Pos                  (9U)
#define USB_OTG_DCTL_SGONAK_Msk                  (0x1UL << USB_OTG_DCTL_SGONAK_Pos) /*!< 0x00000200 */
#define USB_OTG_DCTL_SGONAK                      USB_OTG_DCTL_SGONAK_Msk       /*!< Set global OUT NAK        */
#define USB_OTG_DCTL_CGONAK_Pos                  (10U)
#define USB_OTG_DCTL_CGONAK_Msk                  (0x1UL << USB_OTG_DCTL_CGONAK_Pos) /*!< 0x00000400 */
#define USB_OTG_DCTL_CGONAK                      USB_OTG_DCTL_CGONAK_Msk       /*!< Clear global OUT NAK      */
#define USB_OTG_DCTL_POPRGDNE_Pos                (11U)
#define USB_OTG_DCTL_POPRGDNE_Msk                (0x1UL << USB_OTG_DCTL_POPRGDNE_Pos) /*!< 0x00000800 */
#define USB_OTG_DCTL_POPRGDNE                    USB_OTG_DCTL_POPRGDNE_Msk     /*!< Power-on programming done */

/********************  Bit definition for USB_OTG_HFIR register  ********************/
#define USB_OTG_HFIR_FRIVL_Pos                   (0U)
#define USB_OTG_HFIR_FRIVL_Msk                   (0xFFFFUL << USB_OTG_HFIR_FRIVL_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HFIR_FRIVL                       USB_OTG_HFIR_FRIVL_Msk        /*!< Frame interval */

/********************  Bit definition for USB_OTG_HFNUM register  ********************/
#define USB_OTG_HFNUM_FRNUM_Pos                  (0U)
#define USB_OTG_HFNUM_FRNUM_Msk                  (0xFFFFUL << USB_OTG_HFNUM_FRNUM_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HFNUM_FRNUM                      USB_OTG_HFNUM_FRNUM_Msk       /*!< Frame number         */
#define USB_OTG_HFNUM_FTREM_Pos                  (16U)
#define USB_OTG_HFNUM_FTREM_Msk                  (0xFFFFUL << USB_OTG_HFNUM_FTREM_Pos) /*!< 0xFFFF0000 */
#define USB_OTG_HFNUM_FTREM                      USB_OTG_HFNUM_FTREM_Msk       /*!< Frame time remaining */

/********************  Bit definition for USB_OTG_DSTS register  ********************/
#define USB_OTG_DSTS_SUSPSTS_Pos                 (0U)
#define USB_OTG_DSTS_SUSPSTS_Msk                 (0x1UL << USB_OTG_DSTS_SUSPSTS_Pos) /*!< 0x00000001 */
#define USB_OTG_DSTS_SUSPSTS                     USB_OTG_DSTS_SUSPSTS_Msk      /*!< Suspend status   */

#define USB_OTG_DSTS_ENUMSPD_Pos                 (1U)
#define USB_OTG_DSTS_ENUMSPD_Msk                 (0x3UL << USB_OTG_DSTS_ENUMSPD_Pos) /*!< 0x00000006 */
#define USB_OTG_DSTS_ENUMSPD                     USB_OTG_DSTS_ENUMSPD_Msk      /*!< Enumerated speed */
#define USB_OTG_DSTS_ENUMSPD_0                   (0x1UL << USB_OTG_DSTS_ENUMSPD_Pos) /*!< 0x00000002 */
#define USB_OTG_DSTS_ENUMSPD_1                   (0x2UL << USB_OTG_DSTS_ENUMSPD_Pos) /*!< 0x00000004 */
#define USB_OTG_DSTS_EERR_Pos                    (3U)
#define USB_OTG_DSTS_EERR_Msk                    (0x1UL << USB_OTG_DSTS_EERR_Pos) /*!< 0x00000008 */
#define USB_OTG_DSTS_EERR                        USB_OTG_DSTS_EERR_Msk         /*!< Erratic error     */
#define USB_OTG_DSTS_FNSOF_Pos                   (8U)
#define USB_OTG_DSTS_FNSOF_Msk                   (0x3FFFUL << USB_OTG_DSTS_FNSOF_Pos) /*!< 0x003FFF00 */
#define USB_OTG_DSTS_FNSOF                       USB_OTG_DSTS_FNSOF_Msk        /*!< Frame number of the received SOF */

/********************  Bit definition for USB_OTG_GAHBCFG register  ********************/
#define USB_OTG_GAHBCFG_GINT_Pos                 (0U)
#define USB_OTG_GAHBCFG_GINT_Msk                 (0x1UL << USB_OTG_GAHBCFG_GINT_Pos) /*!< 0x00000001 */
#define USB_OTG_GAHBCFG_GINT                     USB_OTG_GAHBCFG_GINT_Msk      /*!< Global interrupt mask */
#define USB_OTG_GAHBCFG_HBSTLEN_Pos              (1U)
#define USB_OTG_GAHBCFG_HBSTLEN_Msk              (0xFUL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< 0x0000001E */
#define USB_OTG_GAHBCFG_HBSTLEN                  USB_OTG_GAHBCFG_HBSTLEN_Msk   /*!< Burst length/type */
#define USB_OTG_GAHBCFG_HBSTLEN_0                (0x1UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< 0x00000002 */
#define USB_OTG_GAHBCFG_HBSTLEN_1                (0x2UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< 0x00000004 */
#define USB_OTG_GAHBCFG_HBSTLEN_2                (0x4UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< 0x00000008 */
#define USB_OTG_GAHBCFG_HBSTLEN_3                (0x8UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< 0x00000010 */
#define USB_OTG_GAHBCFG_DMAEN_Pos                (5U)
#define USB_OTG_GAHBCFG_DMAEN_Msk                (0x1UL << USB_OTG_GAHBCFG_DMAEN_Pos) /*!< 0x00000020 */
#define USB_OTG_GAHBCFG_DMAEN                    USB_OTG_GAHBCFG_DMAEN_Msk     /*!< DMA enable */
#define USB_OTG_GAHBCFG_TXFELVL_Pos              (7U)
#define USB_OTG_GAHBCFG_TXFELVL_Msk              (0x1UL << USB_OTG_GAHBCFG_TXFELVL_Pos) /*!< 0x00000080 */
#define USB_OTG_GAHBCFG_TXFELVL                  USB_OTG_GAHBCFG_TXFELVL_Msk   /*!< TxFIFO empty level */
#define USB_OTG_GAHBCFG_PTXFELVL_Pos             (8U)
#define USB_OTG_GAHBCFG_PTXFELVL_Msk             (0x1UL << USB_OTG_GAHBCFG_PTXFELVL_Pos) /*!< 0x00000100 */
#define USB_OTG_GAHBCFG_PTXFELVL                 USB_OTG_GAHBCFG_PTXFELVL_Msk  /*!< Periodic TxFIFO empty level */

/********************  Bit definition for USB_OTG_GUSBCFG register  ********************/
#define USB_OTG_GUSBCFG_TOCAL_Pos              (0U)
#define USB_OTG_GUSBCFG_TOCAL_Msk              (0x7UL << USB_OTG_GUSBCFG_TOCAL_Pos)         /*!< 0x00000007 */
#define USB_OTG_GUSBCFG_TOCAL                  USB_OTG_GUSBCFG_TOCAL_Msk                   /*!< FS timeout calibration */
#define USB_OTG_GUSBCFG_TOCAL_0                (0x1UL << USB_OTG_GUSBCFG_TOCAL_Pos)         /*!< 0x00000001 */
#define USB_OTG_GUSBCFG_TOCAL_1                (0x2UL << USB_OTG_GUSBCFG_TOCAL_Pos)         /*!< 0x00000002 */
#define USB_OTG_GUSBCFG_TOCAL_2                (0x4UL << USB_OTG_GUSBCFG_TOCAL_Pos)         /*!< 0x00000004 */
#define USB_OTG_GUSBCFG_SRPCAP_Pos             (8U)
#define USB_OTG_GUSBCFG_SRPCAP_Msk             (0x1UL << USB_OTG_GUSBCFG_SRPCAP_Pos)        /*!< 0x00000100 */
#define USB_OTG_GUSBCFG_SRPCAP                 USB_OTG_GUSBCFG_SRPCAP_Msk                  /*!< SRP-capable */
#define USB_OTG_GUSBCFG_HNPCAP_Pos             (9U)
#define USB_OTG_GUSBCFG_HNPCAP_Msk             (0x1UL << USB_OTG_GUSBCFG_HNPCAP_Pos)        /*!< 0x00000200 */
#define USB_OTG_GUSBCFG_HNPCAP                 USB_OTG_GUSBCFG_HNPCAP_Msk                  /*!< HNP-capable */
#define USB_OTG_GUSBCFG_TRDT_Pos               (10U)
#define USB_OTG_GUSBCFG_TRDT_Msk               (0xFUL << USB_OTG_GUSBCFG_TRDT_Pos)          /*!< 0x00003C00 */
#define USB_OTG_GUSBCFG_TRDT                   USB_OTG_GUSBCFG_TRDT_Msk                    /*!< USB turnaround time */
#define USB_OTG_GUSBCFG_TRDT_0                 (0x1UL << USB_OTG_GUSBCFG_TRDT_Pos)        /*!< 0x00000400 */
#define USB_OTG_GUSBCFG_TRDT_1                 (0x2UL << USB_OTG_GUSBCFG_TRDT_Pos)        /*!< 0x00000800 */
#define USB_OTG_GUSBCFG_TRDT_2                 (0x4UL << USB_OTG_GUSBCFG_TRDT_Pos)       /*!< 0x00001000 */
#define USB_OTG_GUSBCFG_TRDT_3                 (0x8UL << USB_OTG_GUSBCFG_TRDT_Pos)       /*!< 0x00002000 */
#define USB_OTG_GUSBCFG_PHYLPC_Pos             (15U)
#define USB_OTG_GUSBCFG_PHYLPC_Msk             (0x1UL << USB_OTG_GUSBCFG_PHYLPC_Pos)        /*!< 0x00008000 */
#define USB_OTG_GUSBCFG_PHYLPC                 USB_OTG_GUSBCFG_PHYLPC_Msk                  /*!< PHY Low-power clock select */
#define USB_OTG_GUSBCFG_TSDPS_Pos              (22U)
#define USB_OTG_GUSBCFG_TSDPS_Msk              (0x1UL << USB_OTG_GUSBCFG_TSDPS_Pos)         /*!< 0x00400000 */
#define USB_OTG_GUSBCFG_TSDPS                  USB_OTG_GUSBCFG_TSDPS_Msk                   /*!< TermSel DLine pulsing selection */
#define USB_OTG_GUSBCFG_FHMOD_Pos              (29U)
#define USB_OTG_GUSBCFG_FHMOD_Msk              (0x1UL << USB_OTG_GUSBCFG_FHMOD_Pos)         /*!< 0x20000000 */
#define USB_OTG_GUSBCFG_FHMOD                  USB_OTG_GUSBCFG_FHMOD_Msk                   /*!< Force host mode */
#define USB_OTG_GUSBCFG_FDMOD_Pos              (30U)
#define USB_OTG_GUSBCFG_FDMOD_Msk              (0x1UL << USB_OTG_GUSBCFG_FDMOD_Pos)         /*!< 0x40000000 */
#define USB_OTG_GUSBCFG_FDMOD                  USB_OTG_GUSBCFG_FDMOD_Msk                   /*!< Force device mode */

/********************  Bit definition for USB_OTG_GRSTCTL register  ********************/
#define USB_OTG_GRSTCTL_CSRST_Pos              (0U)
#define USB_OTG_GRSTCTL_CSRST_Msk              (0x1UL << USB_OTG_GRSTCTL_CSRST_Pos)         /*!< 0x00000001 */
#define USB_OTG_GRSTCTL_CSRST                  USB_OTG_GRSTCTL_CSRST_Msk                   /*!< Core soft reset */
#define USB_OTG_GRSTCTL_PSRST_Pos              (1U)
#define USB_OTG_GRSTCTL_PSRST_Msk              (0x1UL << USB_OTG_GRSTCTL_PSRST_Pos)         /*!< 0x00000002 */
#define USB_OTG_GRSTCTL_PSRST                  USB_OTG_GRSTCTL_PSRST_Msk                   /*!< Partial soft reset */
#define USB_OTG_GRSTCTL_FCRST_Pos              (2U)
#define USB_OTG_GRSTCTL_FCRST_Msk              (0x1UL << USB_OTG_GRSTCTL_FCRST_Pos)         /*!< 0x00000004 */
#define USB_OTG_GRSTCTL_FCRST                  USB_OTG_GRSTCTL_FCRST_Msk                   /*!< Host frame counter reset */
#define USB_OTG_GRSTCTL_RXFFLSH_Pos            (4U)
#define USB_OTG_GRSTCTL_RXFFLSH_Msk            (0x1UL << USB_OTG_GRSTCTL_RXFFLSH_Pos)       /*!< 0x00000010 */
#define USB_OTG_GRSTCTL_RXFFLSH                USB_OTG_GRSTCTL_RXFFLSH_Msk                 /*!< Rx FIFO flush */
#define USB_OTG_GRSTCTL_TXFFLSH_Pos            (5U)
#define USB_OTG_GRSTCTL_TXFFLSH_Msk            (0x1UL << USB_OTG_GRSTCTL_TXFFLSH_Pos)       /*!< 0x00000020 */
#define USB_OTG_GRSTCTL_TXFFLSH                USB_OTG_GRSTCTL_TXFFLSH_Msk                 /*!< Tx FIFO flush */
#define USB_OTG_GRSTCTL_TXFNUM_Pos             (6U)
#define USB_OTG_GRSTCTL_TXFNUM_Msk             (0x1FUL << USB_OTG_GRSTCTL_TXFNUM_Pos)       /*!< 0x000007C0 */
#define USB_OTG_GRSTCTL_TXFNUM                 USB_OTG_GRSTCTL_TXFNUM_Msk                  /*!< Tx FIFO number */
#define USB_OTG_GRSTCTL_TXFNUM_0               (0x1UL << USB_OTG_GRSTCTL_TXFNUM_Pos)       /*!< 0x00000040 */
#define USB_OTG_GRSTCTL_TXFNUM_1               (0x2UL << USB_OTG_GRSTCTL_TXFNUM_Pos)       /*!< 0x00000080 */
#define USB_OTG_GRSTCTL_TXFNUM_2               (0x4UL << USB_OTG_GRSTCTL_TXFNUM_Pos)      /*!< 0x00000100 */
#define USB_OTG_GRSTCTL_TXFNUM_3               (0x8UL << USB_OTG_GRSTCTL_TXFNUM_Pos)      /*!< 0x00000200 */
#define USB_OTG_GRSTCTL_TXFNUM_4               (0x10UL << USB_OTG_GRSTCTL_TXFNUM_Pos)      /*!< 0x00000400 */
#define USB_OTG_GRSTCTL_DMAREQ_Pos             (30U)
#define USB_OTG_GRSTCTL_DMAREQ_Msk             (0x1UL << USB_OTG_GRSTCTL_DMAREQ_Pos)        /*!< 0x40000000 */
#define USB_OTG_GRSTCTL_DMAREQ                 USB_OTG_GRSTCTL_DMAREQ_Msk                  /*!< DMA request signal enabled */
#define USB_OTG_GRSTCTL_AHBIDL_Pos             (31U)
#define USB_OTG_GRSTCTL_AHBIDL_Msk             (0x1UL << USB_OTG_GRSTCTL_AHBIDL_Pos)        /*!< 0x80000000 */
#define USB_OTG_GRSTCTL_AHBIDL                 USB_OTG_GRSTCTL_AHBIDL_Msk                  /*!< AHB master idle */

/********************  Bit definition for USB_OTG_DIEPMSK register  ********************/
#define USB_OTG_DIEPMSK_XFRCM_Pos              (0U)
#define USB_OTG_DIEPMSK_XFRCM_Msk              (0x1UL << USB_OTG_DIEPMSK_XFRCM_Pos)         /*!< 0x00000001 */
#define USB_OTG_DIEPMSK_XFRCM                  USB_OTG_DIEPMSK_XFRCM_Msk                   /*!< Transfer completed interrupt mask */
#define USB_OTG_DIEPMSK_EPDM_Pos               (1U)
#define USB_OTG_DIEPMSK_EPDM_Msk               (0x1UL << USB_OTG_DIEPMSK_EPDM_Pos)          /*!< 0x00000002 */
#define USB_OTG_DIEPMSK_EPDM                   USB_OTG_DIEPMSK_EPDM_Msk                    /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DIEPMSK_AHBERRM_Pos            (2U)
#define USB_OTG_DIEPMSK_AHBERRM_Msk            (0x1UL << USB_OTG_DIEPMSK_AHBERRM_Pos)       /*!< 0x00000004 */
#define USB_OTG_DIEPMSK_AHBERRM                USB_OTG_DIEPMSK_AHBERRM_Msk                 /*!< AHB error mask */
#define USB_OTG_DIEPMSK_TOM_Pos                (3U)
#define USB_OTG_DIEPMSK_TOM_Msk                (0x1UL << USB_OTG_DIEPMSK_TOM_Pos)           /*!< 0x00000008 */
#define USB_OTG_DIEPMSK_TOM                    USB_OTG_DIEPMSK_TOM_Msk                     /*!< Timeout condition mask (Non-isochronous endpoints) */
#define USB_OTG_DIEPMSK_ITTXFEMSK_Pos          (4U)
#define USB_OTG_DIEPMSK_ITTXFEMSK_Msk          (0x1UL << USB_OTG_DIEPMSK_ITTXFEMSK_Pos)     /*!< 0x00000010 */
#define USB_OTG_DIEPMSK_ITTXFEMSK              USB_OTG_DIEPMSK_ITTXFEMSK_Msk               /*!< IN token received when Tx FIFO empty mask */
#define USB_OTG_DIEPMSK_INEPNMM_Pos            (5U)
#define USB_OTG_DIEPMSK_INEPNMM_Msk            (0x1UL << USB_OTG_DIEPMSK_INEPNMM_Pos)       /*!< 0x00000020 */
#define USB_OTG_DIEPMSK_INEPNMM                USB_OTG_DIEPMSK_INEPNMM_Msk                 /*!< IN token received with EP mismatch mask */
#define USB_OTG_DIEPMSK_INEPNEM_Pos            (6U)
#define USB_OTG_DIEPMSK_INEPNEM_Msk            (0x1UL << USB_OTG_DIEPMSK_INEPNEM_Pos)       /*!< 0x00000040 */
#define USB_OTG_DIEPMSK_INEPNEM                USB_OTG_DIEPMSK_INEPNEM_Msk                 /*!< IN endpoint NAK effective mask */
#define USB_OTG_DIEPMSK_TXFURM_Pos             (8U)
#define USB_OTG_DIEPMSK_TXFURM_Msk             (0x1UL << USB_OTG_DIEPMSK_TXFURM_Pos)        /*!< 0x00000100 */
#define USB_OTG_DIEPMSK_TXFURM                 USB_OTG_DIEPMSK_TXFURM_Msk                  /*!< FIFO underrun mask */
#define USB_OTG_DIEPMSK_BNAM_Pos               (9U)
#define USB_OTG_DIEPMSK_BNAM_Msk               (0x1UL << USB_OTG_DIEPMSK_BNAM_Pos)          /*!< 0x00000200 */
#define USB_OTG_DIEPMSK_BNAM                   USB_OTG_DIEPMSK_BNAM_Msk                    /*!< BNA interrupt mask */
#define USB_OTG_DIEPMSK_NAKM_Pos               (13U)
#define USB_OTG_DIEPMSK_NAKM_Msk               (0x1UL << USB_OTG_DIEPMSK_NAKM_Pos)          /*!< 0x00002000 */
#define USB_OTG_DIEPMSK_NAKM                   USB_OTG_DIEPMSK_NAKM_Msk                    /*!< NAK interrupt mask */                           */

/********************  Bit definition for USB_OTG_HPTXSTS register  ********************/
#define USB_OTG_HPTXSTS_PTXFSAVL_Pos             (0U)
#define USB_OTG_HPTXSTS_PTXFSAVL_Msk             (0xFFFFUL << USB_OTG_HPTXSTS_PTXFSAVL_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HPTXSTS_PTXFSAVL                 USB_OTG_HPTXSTS_PTXFSAVL_Msk  /*!< Periodic transmit data FIFO space available     */
#define USB_OTG_HPTXSTS_PTXQSAV_Pos              (16U)
#define USB_OTG_HPTXSTS_PTXQSAV_Msk              (0xFFUL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00FF0000 */
#define USB_OTG_HPTXSTS_PTXQSAV                  USB_OTG_HPTXSTS_PTXQSAV_Msk   /*!< Periodic transmit request queue space available */
#define USB_OTG_HPTXSTS_PTXQSAV_0                (0x01UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00010000 */
#define USB_OTG_HPTXSTS_PTXQSAV_1                (0x02UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00020000 */
#define USB_OTG_HPTXSTS_PTXQSAV_2                (0x04UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00040000 */
#define USB_OTG_HPTXSTS_PTXQSAV_3                (0x08UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00080000 */
#define USB_OTG_HPTXSTS_PTXQSAV_4                (0x10UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00100000 */
#define USB_OTG_HPTXSTS_PTXQSAV_5                (0x20UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00200000 */
#define USB_OTG_HPTXSTS_PTXQSAV_6                (0x40UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00400000 */
#define USB_OTG_HPTXSTS_PTXQSAV_7                (0x80UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00800000 */
#define USB_OTG_HPTXSTS_PTXQTOP_Pos              (24U)
#define USB_OTG_HPTXSTS_PTXQTOP_Msk              (0xFFUL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0xFF000000 */
#define USB_OTG_HPTXSTS_PTXQTOP                  USB_OTG_HPTXSTS_PTXQTOP_Msk   /*!< Top of the periodic transmit request queue */
#define USB_OTG_HPTXSTS_PTXQTOP_0                (0x01UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x01000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_1                (0x02UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x02000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_2                (0x04UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x04000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_3                (0x08UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x08000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_4                (0x10UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x10000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_5                (0x20UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x20000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_6                (0x40UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x40000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_7                (0x80UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x80000000 */

